# Example of ctlookup

ctlookup translates Connecticut village names to their proper town name.

In [6]:
import pandas as pd
from ctlookup import lookup

def sample_df():
    return pd.DataFrame([["New Preston",1,2],
                      ["Marbledale",110,23],
                      ["Bridgeport",100,97],
                      ["B_water",12,44]
                     ],
                     columns=["TOWN","POP","GDP"])

tmpdf = sample_df()

# Force re-download of lookup table. Slower and requires internet connection.
l = lookup.Lookup(use_inet_csv=True)
# Standard usage
l = lookup.Lookup()

In [7]:
tmpdf

          TOWN  POP  GDP
0  New Preston    1    2
1   Marbledale  110   23
2   Bridgeport  100   97
3      B_water   12   44

In [8]:
l.clean_dataframe(tmpdf,"TOWN")
tmpdf["TOWN_REAL"] = l.clean_dataframe(tmpdf,"TOWN")
tmpdf

          TOWN  POP  GDP   TOWN_REAL
0  New Preston    1    2  WASHINGTON
1   Marbledale  110   23  WASHINGTON
2   Bridgeport  100   97  BRIDGEPORT
3      B_water   12   44         NaN

In [9]:
# Replace in place
tmpdf = sample_df()

l.clean_dataframe(tmpdf,"TOWN")
tmpdf["TOWN"] = l.clean_dataframe(tmpdf,"TOWN")
tmpdf

         TOWN  POP  GDP
0  WASHINGTON    1    2
1  WASHINGTON  110   23
2  BRIDGEPORT  100   97
3         NaN   12   44

In [10]:
# Custom error value
tmpdf = sample_df()

tmpdf["TOWN_REAL"] = \
l.clean_dataframe(tmpdf,
                  "TOWN",
                  error="NOT FOUND")
tmpdf

          TOWN  POP  GDP   TOWN_REAL
0  New Preston    1    2  WASHINGTON
1   Marbledale  110   23  WASHINGTON
2   Bridgeport  100   97  BRIDGEPORT
3      B_water   12   44   NOT FOUND